Masmiseim36/nxpSDK/boards/mimxrt700evk/demo_apps/power_manager_test/bm/cm33_core0/hardware_init.c
void APP_StartTimer(uint64_t timeOutTickes)
{
    if (timeOutTickes != 0U)
    {
        IRTC_SetWriteProtection(APP_RTC, false);
        IRTC_ClearStatusFlags(APP_RTC, kIRTC_WakeTimerFlag);
        IRTC_EnableInterrupts(APP_RTC, kIRTC_WakeTimerInterruptEnable);
        IRTC_SetWakeupCount(APP_RTC, true, (timeOutTickes + 1023UL) / 1024UL);
    }
}

void APP_StopTimer(void)
{
    IRTC_SetWriteProtection(APP_RTC, false);
    IRTC_DisableInterrupts(APP_RTC, kIRTC_WakeTimerInterruptEnable);
}

void APP_InitWakeupSource(void)
{
    gpio_pin_config_t gpioPinConfigStruct;
    irtc_config_t irtcConfig;

    PM_InitWakeupSource(&g_UserkeyWakeupSource, (uint32_t)APP_SW_IRQN, NULL, true);
    PM_InitWakeupSource(&g_timerWakeupSource, (uint32_t)APP_RTC_IRQN, NULL, true);
    PM_RegisterTimerController(&g_pmHandle, APP_StartTimer, APP_StopTimer, NULL, NULL);

    /* Set SW pin as GPIO input. */
    gpioPinConfigStruct.pinDirection = kGPIO_DigitalInput;
    gpioPinConfigStruct.outputLogic  = 0U;

    RESET_ClearPeripheralReset(APP_SW_RESET_RSTn);
    CLOCK_EnableClock(APP_SW_CLOCK_EN);

    GPIO_SetPinInterruptConfig(APP_USER_WAKEUP_KEY_GPIO, APP_USER_WAKEUP_KEY_PIN, kGPIO_InterruptFallingEdge);
    GPIO_PinInit(APP_USER_WAKEUP_KEY_GPIO, APP_USER_WAKEUP_KEY_PIN, &gpioPinConfigStruct);

    IRTC_GetDefaultConfig(&irtcConfig);
    if (IRTC_Init(APP_RTC, &irtcConfig) != kStatus_Success)
    {
        PRINTF("RTC Init Failed.\r\n");
    }
}

uint32_t APP_GetWakeupTimeout(void)
{
    uint8_t timeout;
    uint32_t timeoutTicks = 0U;

    if (g_targetPowerMode < PM_LP_STATE_DSR)
    {
        PRINTF("\r\n Press User button(SW5) to wakeup from Sleep or DeepSleep mode.\r\n");
        timeoutTicks = 0U;
    }
    else if (g_targetPowerMode == PM_LP_STATE_DSR)
    {
        while (1)
        {
            PRINTF("\r\n Select the wake up timeout in seconds.");
            PRINTF("\r\n The allowed range is 0s - 9s.");
            PRINTF("\r\n Eg. enter 0 means no timeout and need reset to wakeup.");
            PRINTF("\r\n Eg. enter 5 to wake up in 5 seconds.");
            PRINTF("\r\n Waiting for input timeout value...");

            timeout = GETCHAR();
            if ((timeout >= '0') && (timeout <= '9'))
            {
                timeout -= '0';
                if (timeout != 0U)
                {
                    PRINTF("\r\n Will wakeup in %d seconds.", timeout);
                    timeoutTicks = (timeout * 1000000UL);
                }
                else
                {
                    timeoutTicks = 0U;
                }
                return timeoutTicks;
            }
            PRINTF("\r\n Wrong value!");
        }
    }
    else
    {
        PRINTF("\r\n The chip enters Deep Power Down or Full Deep Power Down mode only when both cores requested the mode.\r\n");
        PRINTF(" Use reset button to wakeup from Deep Power Down or Full Deep Power Down.\r\n\r\n");
    }

    return timeoutTicks;
}

void APP_RegisterNotify(void)
{
    PM_RegisterNotify(kPM_NotifyGroup2, &g_notify1);
}

void APP_SetConstraints(uint8_t powerMode)
{
    switch (powerMode)
    {
        case PM_LP_STATE_SLEEP:
        {
            PM_SetConstraints(PM_LP_STATE_SLEEP, APP_SLEEP_CONSTRAINTS);
            break;
        }
        case PM_LP_STATE_DEEP_SLEEP:
        {
            PM_SetConstraints(PM_LP_STATE_DEEP_SLEEP, APP_DEEP_SLEEP_CONSTRAINTS);
            break;
        }
        case PM_LP_STATE_DSR:
        {
            PM_SetConstraints(PM_LP_STATE_DSR, APP_DSR_CONSTRAINTS);
            break;
        }
        case PM_LP_STATE_DEEP_POWER_DOWN:
        {
            PM_SetConstraints(PM_LP_STATE_DEEP_POWER_DOWN, APP_DEEP_POWER_DOWN_CONSTRAINTS);
            break;
        }
        case PM_LP_STATE_FULL_DEEP_POWER_DOWN:
        {
            PM_SetConstraints(PM_LP_STATE_FULL_DEEP_POWER_DOWN, APP_FULL_DEEP_POWER_DOWN_CONSTRAINTS);
            break;
        }
        default:
        {
            /* This branch will never be hit. */
            break;
        }
    }
}

void APP_ReleaseConstraints(uint8_t powerMode)
{
    switch (powerMode)
    {
        case PM_LP_STATE_SLEEP:
        {
            PM_ReleaseConstraints(PM_LP_STATE_SLEEP, APP_SLEEP_CONSTRAINTS);
            break;
        }
        case PM_LP_STATE_DEEP_SLEEP:
        {
            PM_ReleaseConstraints(PM_LP_STATE_DEEP_SLEEP, APP_DEEP_SLEEP_CONSTRAINTS);
            break;
        }
        case PM_LP_STATE_DSR:
        {
            PM_ReleaseConstraints(PM_LP_STATE_DSR, APP_DSR_CONSTRAINTS);
            break;
        }
        case PM_LP_STATE_DEEP_POWER_DOWN:
        {
            PM_ReleaseConstraints(PM_LP_STATE_DEEP_POWER_DOWN, APP_DEEP_POWER_DOWN_CONSTRAINTS);
            break;
        }
        case PM_LP_STATE_FULL_DEEP_POWER_DOWN:
        {
            PM_ReleaseConstraints(PM_LP_STATE_FULL_DEEP_POWER_DOWN, APP_FULL_DEEP_POWER_DOWN_CONSTRAINTS);
            break;
        }
        default:
        {
            /* This branch should never be hit. */
            break;
        }
    }
}

/*${function:end}*/
